[{"id":1608977280,"title":"Apple is having iCloud device activation problems at the worst possible time\r","author":"Jon Fingas, @jonfingas\r","date":"December 26, 2020","time":"15:38","thumbnail":"/images/apple.jpg\r","content":"<!--StartFragment-->\r\n\r\nYou’re not alone if you’re having problems getting your newly gifted [iPad](https://www.engadget.com/apple-ipad-air-2020-review-130044886.html) or [Apple Watch](https://www.engadget.com/apple-watch-setup-guide-2020-140037235.html) up and running. As *AppleInsider* first [reported](https://appleinsider.com/articles/20/12/25/apple-icloud-account-and-sign-in-issue-causing-device-activation-setup-problems), Apple is [warning](https://www.apple.com/support/systemstatus/?down&afid=p239%7C10078&cid=aos-ca-aff-ir) of iCloud account and sign-in issues (ongoing as we write this) that appear to have started on Christmas Day — right as many people were setting up their devices for the first time. While Apple didn’t say much in the alert, it told [one Twitter user](https://twitter.com/AppleSupport/status/1342603333115240450?s=20) that “high capacity” was creating problems.\r\n\r\nWe’ve asked Apple for comment.\r\n\r\nIt wouldn’t be shocking if the sheer volume of gifted products was directly responsible. Device activations already tend to spike around Christmas regardless of brand. That demand could easily increase during a pandemic when people are buying tablets to talk to distant friends or [smart speakers](https://www.engadget.com/apple-homepod-mini-review-140030652.html) to play music while working from home.\r\n\r\nStill, this certainly isn’t great timing. It could sour the initial experience of Apple gadgets for many users, even if that feeling is likely to pass once activation works properly. Let’s just hope this issue doesn’t last much longer — and that similar issues don’t affect other manufacturers.\r\n\r\n<!--EndFragment-->"},{"id":1608971040,"title":"Samsung’s next Chromebook may trade a 4K screen for better battery life\r","author":"\" Igor Bonifacic, @igorbonifacic\"\r","date":"December 26, 2020","time":"13:54","thumbnail":"/images/samsung-chromebook.jpg\r","content":"<!--StartFragment-->\r\n\r\nFollowing a [leaked render](https://www.engadget.com/samsung-galaxy-chromebook-2-leaked-image-042830057.html) earlier in the week, more information on Samsung’s Galaxy Chromebook 2 has found its way online, including details on pricing. A marketing slide shared by Microsoft tipster WalkingCat suggests the device will feature a 13.3-inch QLED screen with DCI-P3 wide color gamut coverage, a 10th-gen Core i3 processor and somewhere in the ballpark of 12 hours of battery life. It will also reportedly include louder speakers, WiFi 6 connectivity and a slightly heavier frame than its predecessor. \r\n\r\n<img src=\"https://pbs.twimg.com/media/Ep7x76bU8AIDtJZ?format=jpg&name=small\" />  \r\n\r\n<!--StartFragment-->\r\n\r\nFor context, the first Galaxy Chromebook includes a 4K AMOLED display and a 14nm 10th-gen Intel i5 CPU. That combination of components is the main culprit behind the Galaxy Chromebook’s notoriously bad battery life. In his [review](https://www.engadget.com/samsung-galaxy-chromebook-review-120003557.html#/) of the 2020 model, Engadget’s Nathan Ingraham found he couldn’t get even four hours of use out the Galaxy Chromebook before its battery died. The claim in the above slide suggests Samsung got the memo on battery life.    \r\n\r\nIn a subsequent tweet, WalkingCat said the Galaxy Chromebook 2 will cost $699. We can’t know for sure yet, but that price point likely refers to the entry-level model. That price tag would make the Galaxy Chromebook 2 significantly more affordable than its $999 predecessor and put in more inline with other premium Chromebooks like the [PixelBook Go](https://www.engadget.com/2019-10-25-google-pixelbook-go-review.html). The slide suggests Samsung plans to release the Galaxy Chromebook 2 in February. With [CES 2021](https://www.engadget.com/ces-2021-las-vegas-cancelled-143036671.html) mere weeks away, we’ll likely learn more about the device, and many others, soon.\r\n\r\n<!--EndFragment-->\r\n\r\n<!--EndFragment-->"},{"id":1578188880,"title":"Telegram News\r","author":"Unknown\r","date":"January 05, 2020","time":"07:18","thumbnail":"/images/telegram.jpeg\r","content":"Telegram, nearing 500 million users, to begin monetizing the app.\r\n\r\nInstant messaging app Telegram  is “approaching” 500 million users and plans to generate revenue starting next year to keep the business afloat, its founder Pavel Durov said on Wednesday.\r\n\r\nDurov said he has personally bankrolled the seven-year-old business so far, but as the startup scales he is looking for ways to monetize the instant messaging service. “A project of our size needs at least a few hundred million dollars per year to keep going,” he said."},{"id":1578032400,"title":"Samsung's Galaxy Buds Pro will reportedly cost $199\r","author":"Steve Dent, @stevetdent\r","date":"January 03, 2020","time":"11:50","thumbnail":"/images/samsung-galaxy.jpg\r","content":"<!--StartFragment-->\r\n\r\nWe’ve already learned a lot about Samsung’s upcoming wireless Galaxy Buds Pro thanks to a [leak](https://www.engadget.com/samsungs-galaxy-buds-pro-leak-confirms-applelike-surround-sound-feature-114043086.html) on Samsung’s own site, but one key detail was missing: the price. According to slides leaked on Twitter by [WalkingCat](https://twitter.com/_h0x0d_/status/1341767829926768643) and spotted by *[The Verge](https://www.theverge.com/2020/12/24/22198622/samsung-galaxy-buds-pro-price-specs-active-noise-cancelation)*, however, it looks like they’ll cost $199 — $30 more than Samsung’s [Galaxy Buds Live](https://www.engadget.com/samsung-galaxy-buds-live-review-140007680.html), but a good $50 cheaper than the [AirPods Pro](https://www.engadget.com/2019-11-06-apple-airpods-pro-review.html) from Apple.\r\n\r\nWe already know that the Buds Pro will have active noise cancellation (ANC), an egg-like shape with soft ear canal tips, customizable touch controls, voice detect and more. The latest leak, however, shows what’s inside, including an 11mm woofer and 6.5mm tweeter that will deliver “immersive sound.”\r\n\r\n<img src=\"https://o.aolcdn.com/images/dims?image_uri=https%3A%2F%2Fs.yimg.com%2Fos%2Fcreatr-uploaded-images%2F2020-12%2F1bd4d3f0-45d7-11eb-b96b-f5a58bf08e9c&thumbnail=640%2C&client=49kdj93ncb8s938hkdo&signature=3f21171aa54ea0722424fc1e852c9e4187ad8687\">\r\n\r\n<!--StartFragment-->\r\n\r\nIt also confirms ANC with level control to let you block out more or less surrounding noise, along with a conversation mode, ambient sound controls and noise-free calls. Samsung also apparently confirmed the spatial audio feature along with a “new Galaxy Buds widget,” and said the Buds will offer IPX7 water resistance.\r\n\r\nThe leak, if accurate, confirms that the Galaxy Buds will be competitively priced, but whether they’re worth it depends on the sound and ANC quality. We won’t have to wait long to find out, as the Galaxy Buds Pro are due to be launched in January 2021 along with the Galaxy S21 smartphones.\r\n\r\n<!--EndFragment-->\r\n\r\n<!--EndFragment-->"}]